#define _CRT_SECURE_NO_DEPRECATE 1

#include <stdio.h>

//int main()
//{
//	char a = 3;//a是1byte - 8bit
//	//00000000000000000000000000000011
//	//00000011 - a
//	char b = 127;//b是1byte - 8bit
//	//00000000000000000000000001111111
//	//01111111 - b
//	
//	//a和b都是char类型，自身大小的都是1byte，所以这里计算的时候要进行整型提升
//	//00000000000000000000000000000011
//	//00000000000000000000000001111111
//	//00000000000000000000000010000010
//	//
//	char c = a + b;
//	//10000010 - c
//	//11111111111111111111111110000010 整形提升后的是补码
//	//11111111111111111111111110000001 反码
//	//10000000000000000000000001111110 原码
//	//-126
//	
//	printf("%d\n", c);
//
//	return 0;
//}

//代码3-非法表达式 这是错误的代码！
int main()
{
	int i = 10;
	i = i-- - --i * (i = -3) * i++ + ++i;
	printf("i = %d\n", i);
	return 0;
}