#include <stdio.h>

//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	
//	//10000000000000000000000000010100
//	//11111111111111111111111111101011
//	//11111111111111111111111111101100 - -20的补码
//	//00000000000000000000000000001010 - 10的补码
//  //加后
//	//11111111111111111111111111110110 - 补码
//	//11111111111111111111111111110101
//	//10000000000000000000000000001010
//	//-10
//	printf("%d\n", i + j);//-10
//	//printf("%u\n", i + j);//
//	return 0;
//}

//对于有符号整数的打印就应该是%d
//对于无符号整数的打印就应该用%u





//int main()
//{
//	unsigned int n = -10;
//	/*10000000000000000000000000001010 原码
//	11111111111111111111111111110101 反码
//	11111111111111111111111111110110 补码*/
//	
//	printf("%d\n", n);//-10
//	printf("%u\n", n);//
//
//	return 0;
//}





#include <windows.h>

//int main()
//{
//	unsigned int i;
//	//9 8 7 6 5 4 3 2 1 0 -1
//	//11111111111111111111111111111111
//
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(1000);
//	}
//
//	return 0;
//}



//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}


unsigned char i = 0;
//unsigned char 的取值范围 0~255

int main()
{
	for (i = 0; i <= 255; i++)
	{
		printf("hello world\n");//有无数个
	}

	return 0;
}
